
read_liberty /home/asus/Desktop/MR_PE/Emerging_Multiplier_Architectures/global/NangateOpenCellLibrary_typical.lib
read_verilog /home/asus/Desktop/MR_PE/Emerging_Multiplier_Architectures/Yash/8x8/gate_level_netlists/9-temp_gate_level.v
link_design rr8x8__B__rr6x6__B__rr4x4__B__nr2x2__nr2x2__nr2x2__nr2x2__B__nr4x2__nr2x4__nr2x2__B__nr6x2__nr2x6__nr2x2__B__
read_sdc /home/asus/Desktop/MR_PE/Emerging_Multiplier_Architectures/global/test.sdc
report_power > /home/asus/Desktop/MR_PE/Emerging_Multiplier_Architectures/Yash/8x8/reports/power_reports/9-temp_power.txt
report_checks > /home/asus/Desktop/MR_PE/Emerging_Multiplier_Architectures/Yash/8x8/reports/delay_reports/9-temp_delay.txt
exit
